  ### Deployment Results ✅

  **jcetina** successfully deployed branch `jcetina/more-sites/build` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/35f88978-23c2-47ca-b3a6-8f235c38b09c/terraform-bin apply -no-color -auto-approve -compact-warnings

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# azurerm_virtual_network_gateway_connection.east_west will be created
+ resource "azurerm_virtual_network_gateway_connection" "east_west" {
    + connection_mode                    = "Default"
    + connection_protocol                = (known after apply)
    + enable_bgp                         = (known after apply)
    + express_route_gateway_bypass       = (known after apply)
    + id                                 = (known after apply)
    + location                           = "eastus2"
    + name                               = "east-west-connection"
    + peer_virtual_network_gateway_id    = (known after apply)
    + resource_group_name                = "org-jcetina-repo-baklava-rg"
    + routing_weight                     = (known after apply)
    + shared_key                         = (sensitive value)
    + type                               = "Vnet2Vnet"
    + use_policy_based_traffic_selectors = (known after apply)
    + virtual_network_gateway_id         = (known after apply)
  }

# azurerm_virtual_network_gateway_connection.west_east will be created
+ resource "azurerm_virtual_network_gateway_connection" "west_east" {
    + connection_mode                    = "Default"
    + connection_protocol                = (known after apply)
    + enable_bgp                         = (known after apply)
    + express_route_gateway_bypass       = (known after apply)
    + id                                 = (known after apply)
    + location                           = "westus2"
    + name                               = "west-east-connection"
    + peer_virtual_network_gateway_id    = (known after apply)
    + resource_group_name                = "org-jcetina-repo-baklava-rg"
    + routing_weight                     = (known after apply)
    + shared_key                         = (sensitive value)
    + type                               = "Vnet2Vnet"
    + use_policy_based_traffic_selectors = (known after apply)
    + virtual_network_gateway_id         = (known after apply)
  }

# module.sites["eastus2"].azurerm_public_ip.gateway will be created
+ resource "azurerm_public_ip" "gateway" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 15
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "eastus2"
    + name                    = "azure-eastus2-vgw-pip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
    + zones                   = [
        + "1",
        + "2",
        + "3",
      ]
  }

# module.sites["eastus2"].azurerm_subnet.gateway will be created
+ resource "azurerm_subnet" "gateway" {
    + address_prefixes                               = [
        + "10.0.0.0/27",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "GatewaySubnet"
    + resource_group_name                            = "org-jcetina-repo-baklava-rg"
    + virtual_network_name                           = "azure-eastus2"
  }

# module.sites["eastus2"].azurerm_virtual_network.vnet will be created
+ resource "azurerm_virtual_network" "vnet" {
    + address_space       = [
        + "10.0.0.0/16",
      ]
    + dns_servers         = (known after apply)
    + guid                = (known after apply)
    + id                  = (known after apply)
    + location            = "eastus2"
    + name                = "azure-eastus2"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + subnet              = (known after apply)
  }

# module.sites["eastus2"].azurerm_virtual_network_gateway.gateway will be created
+ resource "azurerm_virtual_network_gateway" "gateway" {
    + active_active       = (known after apply)
    + enable_bgp          = false
    + generation          = (known after apply)
    + id                  = (known after apply)
    + location            = "eastus2"
    + name                = "azure-eastus2-vgw"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + sku                 = "VpnGw2AZ"
    + type                = "Vpn"
    + vpn_type            = "RouteBased"

    + bgp_settings {
        + asn         = (known after apply)
        + peer_weight = (known after apply)

        + peering_addresses {
            + apipa_addresses       = (known after apply)
            + default_addresses     = (known after apply)
            + ip_configuration_name = (known after apply)
            + tunnel_ip_addresses   = (known after apply)
          }
      }

    + ip_configuration {
        + name                          = "vnetGatewayConfig"
        + private_ip_address_allocation = "Dynamic"
        + public_ip_address_id          = (known after apply)
        + subnet_id                     = (known after apply)
      }
  }

# module.sites["westus2"].azurerm_public_ip.gateway will be created
+ resource "azurerm_public_ip" "gateway" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 15
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "westus2"
    + name                    = "azure-westus2-vgw-pip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
    + zones                   = [
        + "1",
        + "2",
        + "3",
      ]
  }

# module.sites["westus2"].azurerm_subnet.gateway will be created
+ resource "azurerm_subnet" "gateway" {
    + address_prefixes                               = [
        + "10.1.0.0/27",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "GatewaySubnet"
    + resource_group_name                            = "org-jcetina-repo-baklava-rg"
    + virtual_network_name                           = "azure-westus2"
  }

# module.sites["westus2"].azurerm_virtual_network.vnet will be created
+ resource "azurerm_virtual_network" "vnet" {
    + address_space       = [
        + "10.1.0.0/16",
      ]
    + dns_servers         = (known after apply)
    + guid                = (known after apply)
    + id                  = (known after apply)
    + location            = "westus2"
    + name                = "azure-westus2"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + subnet              = (known after apply)
  }

# module.sites["westus2"].azurerm_virtual_network_gateway.gateway will be created
+ resource "azurerm_virtual_network_gateway" "gateway" {
    + active_active       = (known after apply)
    + enable_bgp          = false
    + generation          = (known after apply)
    + id                  = (known after apply)
    + location            = "westus2"
    + name                = "azure-westus2-vgw"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + sku                 = "VpnGw2AZ"
    + type                = "Vpn"
    + vpn_type            = "RouteBased"

    + bgp_settings {
        + asn         = (known after apply)
        + peer_weight = (known after apply)

        + peering_addresses {
            + apipa_addresses       = (known after apply)
            + default_addresses     = (known after apply)
            + ip_configuration_name = (known after apply)
            + tunnel_ip_addresses   = (known after apply)
          }
      }

    + ip_configuration {
        + name                          = "vnetGatewayConfig"
        + private_ip_address_allocation = "Dynamic"
        + public_ip_address_id          = (known after apply)
        + subnet_id                     = (known after apply)
      }
  }

Plan: 10 to add, 0 to change, 0 to destroy.
module.sites["westus2"].azurerm_virtual_network.vnet: Creating...
module.sites["eastus2"].azurerm_virtual_network.vnet: Creating...
module.sites["eastus2"].azurerm_virtual_network.vnet: Creation complete after 4s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-eastus2]
module.sites["eastus2"].azurerm_subnet.gateway: Creating...
module.sites["eastus2"].azurerm_public_ip.gateway: Creating...
module.sites["westus2"].azurerm_virtual_network.vnet: Creation complete after 5s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-westus2]
module.sites["westus2"].azurerm_public_ip.gateway: Creating...
module.sites["westus2"].azurerm_subnet.gateway: Creating...
module.sites["westus2"].azurerm_public_ip.gateway: Creation complete after 3s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/azure-westus2-vgw-pip]
module.sites["eastus2"].azurerm_public_ip.gateway: Creation complete after 5s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/azure-eastus2-vgw-pip]
module.sites["eastus2"].azurerm_subnet.gateway: Creation complete after 5s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-eastus2/subnets/GatewaySubnet]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Creating...
module.sites["westus2"].azurerm_subnet.gateway: Creation complete after 5s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-westus2/subnets/GatewaySubnet]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Creating...
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [1m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [2m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [3m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [4m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [5m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [6m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [7m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [8m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [9m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [10m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [11m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [12m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [13m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [14m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [15m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [16m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [17m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [18m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [19m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [19m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [19m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [19m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [19m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [19m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [19m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [19m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [19m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [19m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [19m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [19m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [20m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [20m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [20m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [20m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [20m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [20m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [20m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [20m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [20m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [20m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [20m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [20m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [21m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [21m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [21m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [21m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [21m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [21m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [21m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [21m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [21m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [21m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [21m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [21m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [22m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [22m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [22m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [22m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [22m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [22m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [22m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [22m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [22m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [22m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [22m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [22m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [23m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [23m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [23m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [23m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [23m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [23m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [23m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [23m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [23m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [23m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [23m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [23m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [24m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [24m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [24m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [24m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [24m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [24m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [24m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [24m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [24m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [24m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [24m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [24m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [25m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [25m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [25m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [25m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [25m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [25m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [25m30s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [25m30s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [25m40s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [25m40s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [25m50s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [25m50s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [26m0s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [26m0s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [26m10s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [26m10s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Still creating... [26m20s elapsed]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Still creating... [26m20s elapsed]
module.sites["eastus2"].azurerm_virtual_network_gateway.gateway: Creation complete after 26m23s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworkGateways/azure-eastus2-vgw]
module.sites["westus2"].azurerm_virtual_network_gateway.gateway: Creation complete after 26m25s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworkGateways/azure-westus2-vgw]
azurerm_virtual_network_gateway_connection.west_east: Creating...
azurerm_virtual_network_gateway_connection.east_west: Creating...
azurerm_virtual_network_gateway_connection.west_east: Still creating... [10s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [10s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [20s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [20s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [30s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [30s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [40s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [40s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [50s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [50s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [1m0s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [1m0s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [1m10s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [1m10s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [1m20s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [1m20s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [1m30s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [1m30s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [1m40s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [1m40s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [1m50s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [1m50s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [2m0s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [2m0s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [2m10s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [2m10s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [2m20s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [2m20s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [2m30s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [2m30s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [2m40s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [2m40s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [2m50s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [2m50s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [3m0s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [3m0s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [3m10s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [3m10s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [3m20s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [3m20s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [3m30s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [3m30s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Still creating... [3m40s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [3m40s elapsed]
azurerm_virtual_network_gateway_connection.west_east: Creation complete after 3m44s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/connections/west-east-connection]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [3m50s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [4m0s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [4m10s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [4m20s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [4m30s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [4m40s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [4m50s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [5m0s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [5m10s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [5m20s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [5m30s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [5m40s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [5m50s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [6m0s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [6m10s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Still creating... [6m20s elapsed]
azurerm_virtual_network_gateway_connection.east_west: Creation complete after 6m28s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/connections/east-west-connection]

Apply complete! Resources: 10 added, 0 changed, 0 destroyed.
```

  </details>